artillery/phases.yml
config:
  target: "http://localhost:4000"
  phases:
    - duration: 10
      arrivalRate: 5
      name: "Fixed users"
  plugins:
    metrics-by-endpoint: 
      useRequestNamesOnly: true
      
scenarios:
  - name: "flow"
    flow:
      - put:
          url: "/users/agent-auth"
      # - think: 10
      - put:
          url: "/users/save-image"
      # - think: 10
      - post:
          url: "/files"
      # - think: 10
      - post:
          url: "/v1/activity"
      # - think: 10
      - post:
          url: "/app-usage/insert"
      # - think: 10