artillery/phases.yml
config:
  target: "http://localhost:4000"
  phases:
    - duration: 60
      arrivalRate: 500
      name: "Fixed users"
  
scenarios:
  - name: "flow"
    flow:
      # - get:
      #     url: "/"
      - put:
          url: "/users/agent-auth"
      # - put:
      #     url: "/users/save-image"
      # - post:
      #     url: "/files"
      # - post:
      #     url: "/v1/activity"
      # - post:
      #     url: "/app-usage/insert"